TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ОчередьОтложенногоФормированияИсходящихСообщений/гкс_ОчередьОтложенногоФормированияИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ОчередьОтложенногоФормированияИсходящихСообщений</name>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <comment>Дополнительно наделяет запись уникальностью, так как возможны случаи совпадения порядка у двух разных объектов</comment>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиВОчередь</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВОбработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВосстанавливатьПриОшибкеДесериализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Восстановленный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СформированныеСообщения</name>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>CatalogRef.ИсходящиеСообщения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияОчередиОтложенногоФормирования/гкс_СостоянияОчередиОтложенногоФормирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияОчередиОтложенногоФормирования</name>
  <enumValues>
    <name>ЕстьПроблемы</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетФормирования</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>Сформировано</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ОчередьОтложенногоФормированияИсходящихСообщений/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ДополнитьФорму()
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	МенеджерСостояний = Перечисления.гкс_СостоянияОчередиОтложенногоФормирования;

	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.ЕстьПроблемы, 
											 WebЦвета.Розовый);
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект,  
	                                         МенеджерСостояний.ОжидаетФормирования, 
											 WebЦвета.СветлоЖелтый);
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.Сформировано, 
	                                         WebЦвета.ГолубойСоСтальнымОттенком);
											 
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.Пропущено, 
	                                         WebЦвета.СеребристоСерый);
	
КонецПроцедуры

#КонецОбласти
